#10.1    [] [1,32,2]
#10.2    6   0   5   12  10
#10.3    [30,1,2,1,0,40] [30,43,1,2,1,0,40] [30,43,1,2,1,0,40,1,43] [30,1,2,1,0,40,1,43] [30,2,1,0,40,1,43] [30,2,1,0,40,1] [0,1,1,2,30,40] [40,30,2,1,1,0] 随机排序列表
#10.4    1   2   5   30  0   34
#10.5    [30,1,2,1,0,1,21,13]    [2,42,26]   [2,42,26]   [1,2] 1
#10.6    [30,2] [0, 2, 4, 6, 8] [10,8,6,4,2]
#print([x for x in range(0,10,2)])
#10.7   false   false false True true true
#10.8   false true true true
#list=["1",2,True]
#print(list)
#10.9   [22,43] [1,43]
#10.10  [22,43] [1,43]
'''
list1=[1,43]
list2=[x for x in list1]
print(list2)
'''

#10.11  通过split()   使用‘o’作为分隔符
#10.12  [Flase for i in range(100) ]    list[len(list)-1]=5.5   list[0]+list[1]     sum(list[:5])   min(list)   list[random.range(len(list))]
#10.13  indexError
#10.14  [1,1,2,3,4,5,6]

